app/Controllers/Cliente.php

SELECT `clientes`.`id`, `clientes`.`razao`, `clientes`.`ativo`, `municipio`.`nome` as `cidade`, `municipio`.`uf`
FROM `clientes`
JOIN `municipio` ON `municipio`.`id` = `clientes`.`cidade`
ORDER BY `nome` ASC
---
    public function getAll()
    {
        //garatindo que este método seja chamado apenas via ajax
        if (!$this->request->isAJAX()) {
            return redirect()->back();
        }
        $atributos = ['clientes.id', 'clientes.razao', 'clientes.ativo', 'municipio.nome as cidade', 'municipio.uf'];
        $clientes = $this->clienteModel->select($atributos)
            ->join('municipio', 'municipio.id = clientes.cidade')
            ->orderBy('nome', 'asc')->findAll();

SELECT `id`, `codigo_ibge`, `nome`, `uf`
FROM `municipio`
WHERE `nome` LIKE '%divin%' ESCAPE '!'
ORDER BY `nome` ASC
---
    public function listarCidades()
    {
        //garatindo que este método seja chamado apenas via ajax
        if (!$this->request->isAJAX()) {
            return redirect()->back();
        }

        $municipio = new \App\Models\MunicipioModel();

        $busca = $this->request->getVar('q');
        $retorno = $municipio->select('id, codigo_ibge, nome, uf')
            ->like('nome', $busca)
            ->orderBy('nome', 'ASC')
            ->findAll();