app/Controllers/Escritorio.php

    public function getAll()
    {
        //garatindo que este método seja chamado apenas via ajax
        if (!$this->request->isAJAX()) {
            return redirect()->back();
        }
        $atributos = ['id', 'nome', 'ativo'];
        $escritorios = $this->userModel->select($atributos)->orderBy('nome', 'asc')->findAll();
---
SELECT `id`, `nome`, `ativo`
FROM `users`
ORDER BY `nome` ASC