app/Controllers/Login.php

    public function store()
    {
        $validated = $this->validate(
            [
                'email' => 'required|valid_email',
                'senha' => 'required'
            ],
            [
                'email' => [
                    'required' => 'O email é obrigatório',
                    'valid_email' => 'Informe um email válido'
                ],
                'senha' => [
                    'required' => 'A senha é obrigatória'
                ]
            ]
        );

        if (!$validated) {
            return redirect()->route('login')->with('erros', $this->validator->getErrors());
        }

        $user = new User();
        $userFound = $user->select('id,nome,email,senha')->where('email', $this->request->getPost('email'))->first();
---
SELECT `id`, `nome`, `email`, `senha`
FROM `users`
WHERE `email` = 'email@google.com.br'
 LIMIT 1